package emk;

//Класс, в котором хранится перечисление, которое помогает определять, что конкретно находится между знаками модуля
class enumAbs {                                                                                                         //класс-перечисление
    enum enumAbsExp{                                                                                                    //создали перечисление, состоящее из:
        allExp,                                                                                                         //все выражение
        onlyVal,                                                                                                        //только переменная
        onlyNum                                                                                                         //только число
    }
}
